Задача 1. Конструктор квестов
Напишите конструктор текстовых квестов.
Пользователь вводит названия планеты <Planet>, звездной системы <Star>, имя рейнджера <Ranger> и количество денег вознаграждения <Money>, программа генерирует текст квеста:

Как вам, <Ranger>, известно, мы — раса мирная, поэтому на наших военных кораблях используются наемники с других планет. 
Система набора отработана давным-давно. Обычно мы приглашаем на наши корабли людей с планеты <Planet> системы <Star>.

Но случилась неприятность — в связи с большими потерями в последнее время престиж профессии сильно упал, и теперь не так-то просто завербовать призывников. 
Главный комиссар планеты <Planet>, впрочем, отлично справлялся, но недавно его наградили орденом Сутулого с закруткой на спине, и его на радостях парализовало! 
Призыв под угрозой срыва!

<Ranger>, вы должны прибыть на планету <Planet> системы <Star> и помочь выполнить план призыва. 
Мы готовы выплатить вам премию в <Money> кредитов за эту маленькую услугу.

Задача 2. Симулятор маршрутки
Напишите программу, которая бы симулировала работу маршрутки. 
Она умеет объявлять остановки и узнавать у пользователя, сколько человек вышло на этой остановке и сколько зашло. Работать она должна примерно так:

Прибываем на остановку Улица Программистов. В салоне пассажиров: 0
Сколько пассажиров вышло на остановке? 0
Сколько пассажиров зашло на остановке? 3
Отправляемся с остановки Улица Программистов. В салоне пассажиров: 3
-----------Едем---------
Прибываем на остановку Проспект Алгоритмов. В салоне пассажиров: 3
….
….


Маршрут состоит из 4 остановок. Напишите программу так, чтобы в конце она выводила, сколько денег мы заработали при условии, 
что билет стоит 20 рублей, а расходы следующие:
четверть — на зарплату водителю
пятую часть — на топливо
пятую часть — на налоги
пятую часть — на ремонт машины

Формат вывода (после прибытия на последнюю остановку):

Всего заработали: 100 руб.
Зарплата водителя: 25 руб.
Расходы на топливо: 20 руб.
Налоги: 20 руб.
Расходы на ремонт машины: 20 руб.
Итого доход: 15 руб.

Задача 3. Обмен местами

int main() {
int a = 42;
int b = 153;

std::cout << "a: " << a << "\n";
std::cout << "b: " << b << "\n";
}

Есть код программы с двумя переменными типа int и выводом этих переменных на экран. 
Напишите программу, которая меняет значения переменных местами, то есть нужно добиться того, чтобы в переменной a лежало значение b, а в b - значение a.

Задача 4. Злостные вредители
На бамбуковой плантации завелись гусеницы. Они спят днем и едят бамбук ночью. 
Бамбук генно-модифицированный и растет только при свете дня, зато очень быстро — по 50 сантиметров ежедневно! 
Гусеницы съедают 20 из них каждую ночь. Бамбуковые саженцы при высадке утром имеют высоту 1 метр. Напишите программу, которая:

1. Считает, какой высоты бамбук будет в середине третьего дня.

Усложнение — посчитайте это не за несколько подходов, а одной формулой.

2. Считает, сколько полных дней понадобится бамбуку, чтобы его можно было срубить и продать. Для этого он должен вырасти до 3 метров.

Необязательная часть. Напишите такую же программу, но которая позволяла бы работать с разными гусеницами и разными сортами бамбука.

Пользователь может ввести любую скорость роста бамбука, любую скорость его поедания гусеницами, любую высоту саженца, 
любое количество дней (для первой части задания) и любую целевую высоту взрослого бамбука (для второй части задания).

Примечание. Допускается погрешность в 1 сантиметр для первой части задания. 
Для второй части напишите программу так, чтобы она считала, через какое минимальное количество дней бамбук гарантированно созреет.

Все расчеты проводите в сантиметрах.

Задача 5. Повышаем градус сложности
Необязательная задача. Помните задачу про обмен значений переменных местами? 
Попробуйте решить ее без использования третьей переменной (упс, спойлер, но ничего страшного!) и догадаться, в каких случаях новый способ может не работать и какие у него преимущества.