Задание 1. Улучшаем гонщика 

Исправьте код программы так, чтобы значение скорости рассчитывалось автоматически.
Скорость — это сумма показателей Двигателя, Колес и Руля и минус показатели Дождя и Ветра.

 

#include <iostream>
int main() {
int lap = 4;
int speed = 358;
int engine = 254;
int wheels = 93;
int steerinWheel = 49;
int wind = 21;
int rain = 17;
std::cout << "===================\n";

std::cout << "Супер гонки. Круг " << lap << "\n";

std::cout << "===================\n";

std::cout << "Шумахер (" << speed << ")\n";

std::cout << "===================\n";

std::cout << "Водитель: Шумахер\n";

std::cout << "Скорость: " << speed << "\n";

std::cout << "-------------------\n";

std::cout << "Оснащение\n";

std::cout << "Двигатель: +" << engine << "\n";

std::cout << "Колеса: +" << wheels << "\n";

std::cout << "Руль: +" << steerinWheel << "\n";

std::cout << "-------------------\n";

std::cout << "Действия плохой погоды\n";

std::cout << "Ветер: -" << wind << "\n";

std::cout << "Дождь: -" << rain << "\n";

}

Задание 2. Калькулятор стоимости товара 

Напишите калькулятор для расчета полной стоимости товара. 
Она рассчитывается из стоимости самого товара плюс стоимость доставки минус скидка. 
Все значения сохраните в переменные и выводите в нужных местах, имитируя ввод данных.

Пример работы программы: 

Приветствуем вас в калькуляторе! Он поможет рассчитать полную стоимость товаров с учетом скидок и доставки.

Введите стоимость товара: 6400

Введите стоимость доставки: 350

Введите размер скидки: 700

-----Считаем-----

Итого: 6050

Задание 3. Время, время!

Напишите программу для ресторана быстрого питания “Крылышки и ножки”. 
Они хотят знать, какое количество клиентов успеет обслужить один кассир за рабочую смену. 
Время на обслуживание складывается из времени, за которое клиент делает заказ, и времени, за которое кассир собирает заказ и выдает его клиенту. 
Все расчеты проводите в минутах. Все значения сохраните в переменные и выводите в нужных местах, имитируя ввод данных.

Пример работы программы:

Эта программа рассчитает, сколько клиентов успеет обслужить кассир за смену.

Введите длительность смены в минутах: 480

Сколько минут клиент делает заказ? 2

Сколько минут кассир собирает заказ? 4

-----Считаем-----

За смену длиной 480 минут кассир успеет обслужить 80 клиентов


Задание 4. Непонятная квитанция

Управляющая компания рассылает странные квитанции: в них указана только полная стоимость ремонта многоквартирного дома. 
А сколько должна платить конкретная квартира — не понятно. Напишите программу, с помощью которой жители квартир смогут посчитать, какую сумму им надо заплатить. 
Сумма поровну делится на все квартиры вне зависимости от площади, количества жильцов и комнат. 
Все значения сохраните в переменные и выводите в нужных местах, имитируя ввод данных. 

Пример работы программы:

Приветствуем вас в калькуляторе квартплаты!  

Введите сумму, указанную в квитанции: 4000000
Сколько подъездов в вашем доме? 10
Сколько квартир в каждом подъезде? 40

----Считаем-----

Каждая квартира должна заплатить по 10000 руб